cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/cask-fonts'
tap 'd12frosted/emacs-plus'
tap 'borkdude/brew'

brew 'ack'
brew 'ansible'
brew 'coreutils'
brew 'clj-kondo'
brew 'cmake'
brew 'cmigemo'
brew 'gopls'
brew 'grc'
brew 'grep'
brew 'imagemagick'
brew 'iproute2mac'
brew 'libgccjit'
brew 'markdown'
brew "emacs-plus@29", args: ["with-native-comp", "with-xwidgets", "with-imagemagick"]
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'rg'
brew 'fd'
brew 'mas'
brew 'pueue'
brew 'platformio'
brew 'pngpaste'
brew 'postgresql@14'
brew 'puma/puma/puma-dev'
brew 'roundup'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'w3m'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'alfred'
cask 'bettertouchtool'
cask 'discord'
cask 'microsoft-edge'
cask 'firefox'
cask 'font-fira-code'
cask 'freecad'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'krita'
cask 'miniconda'
cask 'nextcloud'
cask 'slack'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'vlc'

mas "WireGuard", id: 1451685025
