cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/cask-fonts'
tap 'jimeh/emacs-builds'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'rg'
brew 'fd'
brew 'platformio'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'emacs-app'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'handbrake'
cask 'miniconda'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'vlc'
